Repository: RekGRpth/postgis
Catalog: doc/po/*/reference_coverage.xml.po
Languages: fr

source: These functions operate on collections of polygonal geometry that form "implicit coverages" in which any edges shared by the polygons match exactly. These implicit coverages are fast to process, and can be operated on with window functions, which retain the implicit topology inside the window partition while altering the edges.
fr: Ces fonctions opèrent sur des collections de géométrie polygonale qui forment des "couvertures implicites" dans lesquelles toutes les arêtes partagées par les polygones correspondent exactement. Ces couvertures implicites sont rapides à traiter et peuvent être exploitées avec des fonctions window, qui conservent la topologie implicite à l'intérieur de la partition de la window tout en modifiant les arêtes.

source: Coverages
fr: Couvertures

source: Window function that determines if a set of polygons form a valid polygonal coverage.
fr: Fonction window qui détermine si un ensemble de polygones forme une couverture polygonale valide.

source: Checks if the polygons in the window partition form a valid polygonal coverage, and returns linear indicators showing the location of invalid edges in each polygon.
fr: Vérifie si les polygones de la partition de la window forment une couverture polygonale valide et renvoie des indicateurs linéaires montrant l'emplacement des arêtes non valides dans chaque polygone.

source: A set of polygons is a valid coverage if the following conditions hold:
fr: Un ensemble de polygones est une couverture valide si les conditions suivantes sont remplies :

source: <emphasis role="bold">Non-overlapping</emphasis> - polygons do not overlap (their interiors do not intersect)
fr: <emphasis role="bold">Non-overlapping</emphasis> - les polygones ne se chevauchent pas (leurs intérieurs ne s'intersectent pas).

source: <emphasis role="bold">Edge-Matched</emphasis> - vertices along shared edges are identical
fr: <emphasis role="bold">Edge-Matched</emphasis> - les sommets situés le long d'arêtes communes sont identiques.

source: As a window function, a value is returned for every input polygon. For polygons which violate one or more of the validity conditions the return value is a MULTILINESTRING containing the problematic edges. Valid polygons return the value NULL. Non-polygonal or empty geometries also produce NULL values.
fr: En tant que fonction window, une valeur est renvoyée pour chaque polygone d'entrée. Pour les polygones qui ne respectent pas une ou plusieurs des conditions de validité, la valeur renvoyée est un MULTILINESTRING contenant les arêtes problématiques. Les polygones valides renvoient la valeur NULL. Les géométries non polygonales ou vides produisent également des valeurs NULL.

source: The conditions allow a valid coverage to contain holes (gaps between polygons), as long as the surrounding polygons are edge-matched. However, very narrow gaps are often undesirable. If the <parameter>tolerance</parameter> parameter is specified with a non-zero distance, edges forming narrower gaps will also be returned as invalid.
fr: Les conditions permettent à une couverture valide de contenir des trous (espaces entre les polygones), pour autant que les polygones environnants soient adaptés aux bords. Toutefois, des espaces très étroits ne sont souvent pas souhaitables. Si le paramètre <parameter>tolérance</parameter> est spécifié avec une distance non nulle, les arêtes formant des espaces plus étroits seront également renvoyées comme non valides.

source: Availability: 3.4.0 - requires GEOS &gt;= 3.12.0
fr: Disponibilité : 3.4.0 - nécessite GEOS &gt;= 3.12.0

source: Examples
fr: Exemples

source: -- Test entire table for validity SELECT true = ALL ( SELECT ST_CoverageInvalidLocations(geom) OVER () IS NULL FROM coverage );
fr: -- Tester la validité de l'ensemble de la table SELECT true = ALL ( SELECT ST_CoverageInvalidLocations(geom) OVER () IS NULL FROM coverage ) ;

source: See Also
fr: Voir aussi

source: Window function that simplifies the edges of an implicit polygonal coverage, using the Visvalingam–Whyatt algorithm.
fr: Fonction window qui simplifie les bords d'une couverture polygonale implicite, en utilisant l'algorithme de Visvalingam-Whyatt.

source: A window function which simplifies the edges of polygons in a polygonal coverage using the <ulink url="https://en.wikipedia.org/wiki/Visvalingam%E2%80%93Whyatt_algorithm">Visvalingam–Whyatt algorithm</ulink>. For inputs forming a valid polygonal coverage the simplified outputs are consisent along shared edges, and still form a valid coverage.
fr: Une fonction de fenêtre qui simplifie les bords des polygones dans une couverture polygonale à l'aide de l'algorithme <ulink url="https://en.wikipedia.org/wiki/Visvalingam%E2%80%93Whyatt_algorithm">Visvalingam-Whyatt</ulink>. Pour les entrées formant une couverture polygonale valide, les sorties simplifiées sont cohérentes le long des arêtes communes et forment toujours une couverture valide.

source: To simplify only the "internal" edges of the coverage (those that are shared by two polygons) set the <parameter>simplifyBoundary</parameter> parameter to false.
fr: Pour simplifier uniquement les bords "internes" de la couverture (ceux qui sont partagés par deux polygones), définissez le paramètre <parameter>simplifyBoundary</parameter> à false.

source: If the input is not a valid coverage there may be unexpected artifacts in the output (such as boundary intersections, or separated boundaries which appeared to be shared).
fr: Si l'entrée n'est pas une couverture valide, il peut y avoir des artefacts inattendus dans la sortie (tels que des intersections de frontières, ou des frontières séparées qui semblaient être partagées).

source: Unions a set of polygons forming a coverage by removing shared edges.
fr: Fusion d'un ensemble de polygones formant une couverture en supprimant les arêtes communes.

source: An aggregate function which performs a high-speed union of a set of polygons forming a polygonal coverage. This function only works with inputs that are coverages: no overlaps, and all shared edges identical down to the vertex level. See <xref linkend="ST_CoverageInvalidLocations"/> for a way to test that a set of polygons are a valid polygonal coverage.
fr: Une fonction agrégée qui réalise une union à grande vitesse d'un ensemble de polygones formant une couverture polygonale. Cette fonction ne fonctionne qu'avec des entrées qui sont des couvertures : pas de chevauchements, et toutes les arêtes partagées identiques jusqu'au niveau du sommet. Voir <xref linkend="ST_CoverageInvalidLocations"/> pour tester qu'un ensemble de polygones constitue une couverture polygonale valide.

source: If the input is not a valid coverage there may be unexpected artifacts in the output (such as unmerged or overlapping polygons).
fr: Si l'entrée n'est pas une couverture valide, il peut y avoir des artefacts inattendus dans la sortie (tels que des polygones non fusionnés ou se chevauchant).

source: Availability: 3.4.0 - requires GEOS &gt;= 3.8.0
fr: Disponibilité : 3.4.0 - nécessite GEOS &gt;= 3.8.0
