Repository: RekGRpth/postgis
Catalog: doc/po/*/using_postgis_app.xml.po
Languages: fr

source: Building Applications
fr: Construire des applications

source: Using MapServer
fr: Utiliser MapServer

source: The Minnesota MapServer is an internet web-mapping server which conforms to the OpenGIS Web Map Service specification.
fr: Le Minnesota MapServer est un serveur de cartographie Web conforme à la spécification OpenGIS Web Map Service.

source: The MapServer homepage is at <ulink url="http://mapserver.org">http://mapserver.org</ulink>.
fr: La page internet de MapServer est <ulink url="http://mapserver.org">http://mapserver.org</ulink>.

source: The OpenGIS Web Map Service specification is at <ulink url="http://www.opengeospatial.org/standards/wms">http://www.opengeospatial.org/standards/wms</ulink>.
fr: La spécification du service de cartographie Web d'OpenGIS est disponible à l'adresse <ulink url="http://www.opengeospatial.org/standards/wms">http://www.opengeospatial.org/standards/wms</ulink>.

source: Basic Usage
fr: Utilisation basique

source: To use PostGIS with MapServer, you need to know how to configure MapServer, which is beyond the scope of this documentation. This section covers specific PostGIS issues and configuration details.
fr: Afin d'utiliser conjointement PostGIS et MapServer, il est nécessaire au préalable de savoir comment configurer MapServer ce qui est bien au-delà de l'objectif de cette documentation. Cette section portera spécifiquement sur les aspects relatifs à PostGIS.

source: To use PostGIS with MapServer, you will need:
fr: Pour utiliser PostGIS avec MapServer, vous aurez besoin de :

source: Version 0.6 or newer of PostGIS.
fr: La version 0.6 - ou plus récente - de PostGIS.

source: Version 3.5 or newer of MapServer.
fr: La version 3.5 - ou plus récente - de MapServer.

source: MapServer accesses PostGIS/PostgreSQL data like any other PostgreSQL client, using the <filename>libpq</filename> interface. This means that MapServer can be installed on any machine with network access to the PostGIS server, and use PostGIS as a source of data. The faster the connection between the systems, the better.
fr: MapServer communique avec PostGIS/PostgreSQL en utilisant l'interface <filename>libpq</filename> comme n'importe quel autre client PostgreSQL. Cela signifie que pour utiliser PostGIS, MapServer peut être installé sur n'importe quelle machine disposant d'un accès internet au serveur PostGIS. Plus la connexion entre les deux systèmes est rapide et meilleur seront les performances.

source: Compile and install MapServer, with whatever options you desire, including the "--with-postgis" configuration option.
fr: Compilez et installez MapServer, avec les options que vous souhaitez, y compris l'option de configuration "--with-postgis".

source: In your MapServer map file, add a PostGIS layer. For example:
fr: Dans votre fichier MapFIle, ajoutez une couche PostGIS. Par exemple :

source: LAYER CONNECTIONTYPE postgis NAME "widehighways" # Connect to a remote spatial database CONNECTION "user=dbuser dbname=gisdatabase host=bigserver" PROCESSING "CLOSE_CONNECTION=DEFER" # Get the lines from the 'geom' column of the 'roads' table DATA "geom from roads using srid=4326 using unique gid" STATUS ON TYPE LINE # Of the lines in the extents, only render the wide highways FILTER "type = 'highway' and numlanes &gt;= 4" CLASS # Make the superhighways brighter and 2 pixels wide EXPRESSION ([numlanes] &gt;= 6) STYLE COLOR 255 22 22 WIDTH 2 END END CLASS # All the rest are darker and only 1 pixel wide EXPRESSION ([numlanes] &lt; 6) STYLE COLOR 205 92 82 END END END
fr: LAYER CONNECTIONTYPE postgis NAME "widehighways" # Connexion à la base de données CONNECTION "user=dbuser dbname=gisdatabase host=bigserver" PROCESSING "CLOSE_CONNECTION=DEFER" # Récupère les informations géographiques de la colonne 'geom' de la table 'roads' DATA "geom from roads using srid=4326 using unique gid" STATUS ON TYPE LINE # Seule les routes principales seront affichées FILTER "type = 'highway' and numlanes &gt;= 4" CLASS # Le trait représentant les routes importantes sera plus clair et large de 2 pixels EXPRESSION ([numlanes] &gt;= 6) STYLE COLOR 255 22 22 WIDTH 2 END END CLASS # Toute les autres seront dessinées en couleur sombre avec un trait d'1 pixel d'épaisseur EXPRESSION ([numlanes] &lt; 6) STYLE COLOR 205 92 82 END END END

source: In the example above, the PostGIS-specific directives are as follows:
fr: Dans l'exemple ci-dessus, les directives spécifiques à PostGIS sont les suivantes :

source: For PostGIS layers, this is always "postgis".
fr: Pour les couches de données PostGIS, cela sera toujours "postgis".

source: The database connection is governed by the a 'connection string' which is a standard set of keys and values like this (with the default values in &lt;&gt;):
fr: La connexion à la base de données est régie par une "chaîne de connexion" qui est un ensemble standard de clés et de valeurs comme ceci (avec les valeurs par défaut dans &lt;&gt;) :

source: An empty connection string is still valid, and any of the key/value pairs can be omitted. At a minimum you will generally supply the database name and username to connect with.
fr: Une chaîne de connexion vide est toujours valide, et toutes les paires clé/valeur peuvent être omises. Au minimum, vous devez fournir le nom de la base de données et le nom d'utilisateur avec lesquels vous devez vous connecter.

source: The form of this parameter is "&lt;geocolumn&gt; from &lt;tablename&gt; using srid=&lt;srid&gt; using unique &lt;primary key&gt;" where the column is the spatial column to be rendered to the map, the SRID is SRID used by the column and the primary key is the table primary key (or any other uniquely-valued column with an index).
fr: La forme de ce paramètre est "&lt;geocolumn&gt; from &lt;tablename&gt; using srid=&lt;srid&gt; using unique &lt;primary key&gt;" où la colonne est la colonne spatiale à rendre dans la carte, le SRID est le SRID utilisé par la colonne et la clé primaire est la clé primaire de la table (ou toute autre colonne à valeur unique avec un index).

source: You can omit the "using srid" and "using unique" clauses and MapServer will automatically determine the correct values if possible, but at the cost of running a few extra queries on the server for each map draw.
fr: Vous pouvez omettre les clauses "using srid" et "using unique" et MapServer déterminera automatiquement les valeurs correctes si possible, mais au prix de quelques requêtes supplémentaires sur le serveur pour chaque dessin de carte.

source: Putting in a CLOSE_CONNECTION=DEFER if you have multiple layers reuses existing connections instead of closing them. This improves speed. Refer to for <ulink url="http://blog.cleverelephant.ca/2008/10/mapserverpostgis-performance-tips.html">MapServer PostGIS Performance Tips</ulink> for a more detailed explanation.
fr: L'ajout d'une CLOSE_CONNECTION=DEFER en cas de couches multiples permet de réutiliser les connexions existantes au lieu de les fermer. Cela améliore la vitesse. Reportez-vous à <ulink url="http://blog.cleverelephant.ca/2008/10/mapserverpostgis-performance-tips.html">MapServer PostGIS Performance Tips</ulink> pour une explication plus détaillée.

source: The filter must be a valid SQL string corresponding to the logic normally following the "WHERE" keyword in a SQL query. So, for example, to render only roads with 6 or more lanes, use a filter of "num_lanes &gt;= 6".
fr: Le filtre doit être une chaîne SQL valide correspondant à la logique qui suit normalement le mot clé "WHERE" dans une requête SQL. Ainsi, par exemple, pour afficher uniquement les routes comportant 6 voies ou plus, utilisez le filtre "num_lanes &gt;= 6".

source: In your spatial database, ensure you have spatial (GiST) indexes built for any the layers you will be drawing.
fr: Dans votre base de données spatiale, assurez-vous que vous avez construit des index spatiaux (GiST) pour toutes les couches que vous allez dessiner.

source: If you will be querying your layers using MapServer you will also need to use the "using unique" clause in your DATA statement.
fr: Si vous souhaitez interroger vos couches à l'aide de MapServer, vous devrez également utiliser la clause "using unique" dans votre déclaration DATA.

source: MapServer requires unique identifiers for each spatial record when doing queries, and the PostGIS module of MapServer uses the unique value you specify in order to provide these unique identifiers. Using the table primary key is the best practice.
fr: MapServer a besoin d'identifiants uniques pour chaque enregistrement spatial lorsqu'il effectue des requêtes, et le module PostGIS de MapServer utilise la valeur unique que vous spécifiez afin de fournir ces identifiants uniques. L'utilisation de la clé primaire de la table est la meilleure pratique.

source: Frequently Asked Questions
fr: Questions les plus fréquemment posées

source: When I use an <varname>EXPRESSION</varname> in my map file, the condition never returns as true, even though I know the values exist in my table.
fr: Lorsque j'utilise une <varname>EXPRESSION</varname> dans mon fichier map, la condition ne revient jamais comme vraie, même si je sais que les valeurs existent dans ma table.

source: Unlike shape files, PostGIS field names have to be referenced in EXPRESSIONS using <emphasis>lower case</emphasis>.
fr: Contrairement aux fichiers shape, les noms de champs PostGIS doivent être référencés dans EXPRESSIONS en utilisant des <emphasis>minuscules</emphasis>.

source: The FILTER I use for my Shapefiles is not working for my PostGIS table of the same data.
fr: Le FILTRE que j'utilise pour mes Shapefiles ne fonctionne pas pour ma table PostGIS avec les mêmes données.

source: Unlike shape files, filters for PostGIS layers use SQL syntax (they are appended to the SQL statement the PostGIS connector generates for drawing layers in MapServer).
fr: Contrairement aux fichiers shape, les filtres pour les couches PostGIS utilisent la syntaxe SQL (ils sont ajoutés à l'instruction SQL que le connecteur PostGIS génère pour dessiner les couches dans MapServer).

source: My PostGIS layer draws much slower than my Shapefile layer, is this normal?
fr: Ma couche PostGIS se dessine beaucoup plus lentement que ma couche Shapefile, est-ce normal ?

source: In general, the more features you are drawing into a given map, the more likely it is that PostGIS will be slower than Shapefiles. For maps with relatively few features (100s), PostGIS will often be faster. For maps with high feature density (1000s), PostGIS will always be slower.
fr: En général, plus vous dessinez d'éléments dans une carte donnée, plus il est probable que PostGIS soit plus lent que Shapefiles. Pour les cartes comportant relativement peu d'éléments (quelques centaines), PostGIS sera souvent plus rapide. Pour les cartes à forte densité d'éléments (des milliers), PostGIS sera toujours plus lent.

source: If you are finding substantial draw performance problems, it is possible that you have not built a spatial index on your table.
fr: Si vous rencontrez d'importants problèmes de performances en matière de dessin, il est possible que vous n'ayez pas créé d'index spatial sur votre table.

source: My PostGIS layer draws fine, but queries are really slow. What is wrong?
fr: Mes couches de données PostGIS s'affichent correctement, mais les requêtes sont longues. Qu'est ce qui ne va pas ?

source: For queries to be fast, you must have a unique key for your spatial table and you must have an index on that unique key.
fr: Afin que vos requêtes s'exécutent rapidement, vos enregistrements doivent être identifiables par une clé unique, identifiant qui doit également avoir été indexé.

source: You can specify what unique key for mapserver to use with the <varname>USING UNIQUE</varname> clause in your <varname>DATA</varname> line:
fr: Vous pouvez spécifier la clé unique que mapserver doit utiliser avec la clause <varname>USING UNIQUE</varname> dans votre ligne <varname>DATA</varname> :

source: Can I use "geography" columns (new in PostGIS 1.5) as a source for MapServer layers?
fr: Puis-je utiliser les colonnes "géographie" (nouveau dans PostGIS 1.5) comme source pour les couches MapServer ?

source: Yes! MapServer understands geography columns as being the same as geometry columns, but always using an SRID of 4326. Just make sure to include a "using srid=4326" clause in your <varname>DATA</varname> statement. Everything else works exactly the same as with geometry.
fr: Oui ! MapServer considère que les colonnes géographiques sont identiques aux colonnes géométriques, mais qu'elles utilisent toujours un SRID égal à 4326. Assurez-vous simplement d'inclure une clause "using srid=4326" dans votre déclaration <varname>DATA</varname>. Tout le reste fonctionne exactement de la même manière qu'avec la géométrie.

source: Advanced Usage
fr: Usage avancé

source: The <varname>USING</varname> pseudo-SQL clause is used to add some information to help mapserver understand the results of more complex queries. More specifically, when either a view or a subselect is used as the source table (the thing to the right of "FROM" in a <varname>DATA</varname> definition) it is more difficult for mapserver to automatically determine a unique identifier for each row and also the SRID for the table. The <varname>USING</varname> clause can provide mapserver with these two pieces of information as follows:
fr: La clause pseudo-SQL <varname>USING</varname> est utilisée pour ajouter certaines informations afin d'aider mapserver à comprendre les résultats de requêtes plus complexes. Plus précisément, lorsqu'une vue ou une sous-sélection est utilisée comme table source (ce qui se trouve à droite de "FROM" dans une définition de <varname>DATA</varname>), il est plus difficile pour mapserver de déterminer automatiquement un identifiant unique pour chaque ligne ainsi que le SRID pour la table. La clause <varname>USING</varname> peut fournir à mapserver ces deux informations comme suit :

source: MapServer requires a unique id for each row in order to identify the row when doing map queries. Normally it identifies the primary key from the system tables. However, views and subselects don't automatically have an known unique column. If you want to use MapServer's query functionality, you need to ensure your view or subselect includes a uniquely valued column, and declare it with <varname>USING UNIQUE</varname>. For example, you could explicitly select nee of the table's primary key values for this purpose, or any other column which is guaranteed to be unique for the result set.
fr: MapServer a besoin d'un identifiant unique pour chaque ligne afin d'identifier la ligne lors des requêtes. Normalement, il s'agit de la clé primaire des tables du système. Cependant, les vues et les sous-sélections n'ont pas automatiquement une colonne unique connue. Si vous souhaitez utiliser la fonctionnalité de requête de MapServer, vous devez vous assurer que votre vue ou votre sous-sélection comprend une colonne à valeur unique et la déclarer avec <varname>USING UNIQUE</varname>. Par exemple, vous pouvez sélectionner explicitement l'une des valeurs de la clé primaire de la table à cette fin, ou toute autre colonne dont l'unicité est garantie pour l'ensemble des résultats.

source: "Querying a Map" is the action of clicking on a map to ask for information about the map features in that location. Don't confuse "map queries" with the SQL query in a <varname>DATA</varname> definition.
fr: "Interroger une carte" est l'action de cliquer sur une carte pour demander des informations sur les caractéristiques de la carte à cet endroit. Ne confondez pas les "requêtes cartographiques" avec la requête SQL contenue dans une définition de <varname>DATA</varname>.

source: PostGIS needs to know which spatial referencing system is being used by the geometries in order to return the correct data back to MapServer. Normally it is possible to find this information in the "geometry_columns" table in the PostGIS database, however, this is not possible for tables which are created on the fly such as subselects and views. So the <varname>USING SRID=</varname> option allows the correct SRID to be specified in the <varname>DATA</varname> definition.
fr: PostGIS a besoin de savoir quel système de référencement spatial est utilisé par les géométries afin de renvoyer les données correctes à MapServer. Normalement, il est possible de trouver cette information dans la table "geometry_columns" de la base de données PostGIS, mais ce n'est pas possible pour les tables qui sont créées à la volée, telles que les sous-sélections et les vues. L'option <varname>USING SRID=</varname> permet donc de spécifier le SRID correct dans la définition de <varname>DATA</varname>.

source: Examples
fr: Exemples

source: Lets start with a simple example and work our way up. Consider the following MapServer layer definition:
fr: Commençons par un exemple simple et progressons. Considérons la définition suivante de la couche MapServer :

source: This layer will display all the road geometries in the roads table as black lines.
fr: Cette couche affiche toutes les géométries routières de la table des routes sous forme de lignes noires.

source: Now lets say we want to show only the highways until we get zoomed in to at least a 1:100000 scale - the next two layers will achieve this effect:
fr: Supposons maintenant que nous voulions n'afficher que les autoroutes jusqu'à ce que nous fassions un zoom avant à une échelle d'au moins 1:100000 - les deux couches suivantes permettront d'obtenir cet effet :

source: The first layer is used when the scale is greater than 1:100000, and displays only the roads of type "highway" as black lines. The <varname>FILTER</varname> option causes only roads of type "highway" to be displayed.
fr: La première couche est utilisée lorsque l'échelle est supérieure à 1:100000, et affiche uniquement les routes de type "autoroute" sous forme de lignes noires. L'option <varname>FILTER</varname> permet de n'afficher que les routes de type "highway".

source: The second layer is used when the scale is less than 1:100000, and will display highways as double-thick red lines, and other roads as regular black lines.
fr: La deuxième couche est utilisée lorsque l'échelle est inférieure à 1:100000, et affiche les autoroutes sous forme de lignes rouges à double épaisseur, et les autres routes sous forme de lignes noires normales.

source: So, we have done a couple of interesting things using only MapServer functionality, but our <varname>DATA</varname> SQL statement has remained simple. Suppose that the name of the road is stored in another table (for whatever reason) and we need to do a join to get it and label our roads.
fr: Nous avons donc réalisé plusieurs choses intéressantes en utilisant uniquement les fonctionnalités de MapServer, mais notre instruction SQL <varname>DATA</varname> est restée simple. Supposons que le nom de la route soit stocké dans une autre table (pour une raison quelconque) et que nous devions effectuer une jointure pour l'obtenir et étiqueter nos routes.

source: This annotation layer adds green labels to all the roads when the scale gets down to 1:20000 or less. It also demonstrates how to use an SQL join in a <varname>DATA</varname> definition.
fr: Cette couche d'annotation ajoute des étiquettes vertes à toutes les routes lorsque l'échelle est réduite à 1:20000 ou moins. Elle montre également comment utiliser une jointure SQL dans une définition <varname>DATA</varname>.

source: Java Clients (JDBC)
fr: Clients Java (JDBC)

source: Java clients can access PostGIS "geometry" objects in the PostgreSQL database either directly as text representations or using the JDBC extension objects bundled with PostGIS. In order to use the extension objects, the "postgis.jar" file must be in your CLASSPATH along with the "postgresql.jar" JDBC driver package.
fr: Les clients Java peuvent accéder aux objets "géométrie" de PostGIS dans la base de données PostgreSQL, soit directement sous forme de représentations textuelles, soit en utilisant les objets d'extension JDBC fournis avec PostGIS. Pour utiliser les objets d'extension, le fichier "postgis.jar" doit figurer dans votre CLASSPATH avec le pilote JDBC "postgresql.jar".

source: import java.sql.*; import java.util.*; import java.lang.*; import org.postgis.*; public class JavaGIS { public static void main(String[] args) { java.sql.Connection conn; try { /* * Load the JDBC driver and establish a connection. */ Class.forName("org.postgresql.Driver"); String url = "jdbc:postgresql://localhost:5432/database"; conn = DriverManager.getConnection(url, "postgres", ""); /* * Add the geometry types to the connection. Note that you * must cast the connection to the pgsql-specific connection * implementation before calling the addDataType() method. */ ((org.postgresql.PGConnection)conn).addDataType("geometry",Class.forName("org.postgis.PGgeometry")); ((org.postgresql.PGConnection)conn).addDataType("box3d",Class.forName("org.postgis.PGbox3d")); /* * Create a statement and execute a select query. */ Statement s = conn.createStatement(); ResultSet r = s.executeQuery("select geom,id from geomtable"); while( r.next() ) { /* * Retrieve the geometry as an object then cast it to the geometry type. * Print things out. */ PGgeometry geom = (PGgeometry)r.getObject(1); int id = r.getInt(2); System.out.println("Row " + id + ":"); System.out.println(geom.toString()); } s.close(); conn.close(); } catch( Exception e ) { e.printStackTrace(); } } }
fr: import java.sql.* ; import java.util.* ; import java.lang.* ; import org.postgis.* ; public class JavaGIS { public static void main(String[] args) { java.sql.Connection conn ; try { /* * Charger le pilote JDBC et établir une connexion. */ Class.forName("org.postgresql.Driver") ; String url = "jdbc :postgresql ://localhost :5432/database" ; conn = DriverManager.getConnection(url, "postgres", "") ; /* * Ajouter les types de géométrie à la connexion. Notez que vous * devez adapter la connexion à l'implémentation de connexion spécifique à pgsql * avant d'appeler la méthode addDataType(). */ ((org.postgresql.PGConnection)conn).addDataType("geometry",Class.forName("org.postgis.PGgeometry")) ; ((org.postgresql.PGConnection)conn).addDataType("box3d",Class.forName("org.postgis.PGbox3d")) ; /* * Créer une instruction et exécuter une requête de sélection.. */ Statement s = conn.createStatement() ; ResultSet r = s.executeQuery("select geom,id from geomtable") ; while( r.next() ) { /* * Récupérer la géométrie en tant qu'objet, puis la convertir en type de géométrie. * Imprimer les choses. */ PGgeometry geom = (PGgeometry)r.getObject(1) ; int id = r.getInt(2) ; System.out.println("Row " + id + " :") ; System.out.println(geom.toString()) ; } s.close() ; conn.close() ; } catch( Exception e ) { e.printStackTrace() ; } } }

source: The "PGgeometry" object is a wrapper object which contains a specific topological geometry object (subclasses of the abstract class "Geometry") depending on the type: Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon.
fr: L'objet "PGgeometry" est un objet enveloppant qui contient un objet géométrique topologique spécifique (sous-classes de la classe abstraite "Geometry") en fonction du type : Point, LineString, Polygon, MultiPoint, MultiLineString, MultiPolygon.

source: The JavaDoc for the extension objects provides a reference for the various data accessor functions in the geometric objects.
fr: La JavaDoc des objets d'extension fournit une référence pour les différentes fonctions d'accès aux données dans les objets géométriques.

source: Text Cursors
fr: Curseurs de texte

source: Binary Cursors
fr: Curseurs binaires
